[
  {
    "id": "item-garrafa-variantes-001",
    "name": "Garrafa Térmica Inox 800 ml Parede Dupla – Mantém Bebida Gelada 24h ou Quente 8h",
    "price": 55.86,
    "costPrice": 39.9,
    "originalPrice": 79.9,
    "description": "➡️ Capacidade ideal de 800 ml – água, suco ou café pra encarar o dia inteiro sem precisar ficar reabastecendo toda hora. Tamanho perfeito pra academia, trabalho, escola ou viagens.\n\n➡️ Parede dupla a vácuo em aço inox – mantém bebidas geladas por até 24h e quentes por até 8h, sem \"suor\" por fora e sem esquentar a mão. Térmica de respeito mesmo.\n\n➡️ Aço inox resistente e higiênico – não pega cheiro, não enferruja e aguenta o tranco da rotina. Ideal para uso diário, trilhas, pedal, praia e escritório.\n\n➡️ Tampa com bico de abertura rápida – é só abrir, beber e fechar. Vedação eficiente para evitar vazamentos na mochila, bolsa ou no carro quando bem rosqueado.\n\n➡️ Alça prática para levar em qualquer lugar – pendure na mochila, segure na mão ou prenda no mosquetão. Perfeita pra quem vive no corre e quer hidratação sempre por perto.",
    "images": [
      "https://m.media-amazon.com/images/I/51vK-L7L8pL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/51vB8v+zX9L._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/51wX8v+zX9L._AC_SX679_.jpg"
    ],
    "category": "equipment",
    "rating": 4.8,
    "reviews": 285,
    "sizes": [],
    "colors": [
      "Vermelho",
      "Preto",
      "Azul",
      "Inox"
    ],
    "variants": [
      {
        "name": "Vermelho",
        "image": "https://m.media-amazon.com/images/I/51vK-L7L8pL._AC_SX679_.jpg",
        "price": 39.90,
        "originalPrice": 42.90
      },
      {
        "name": "Preto",
        "image": "https://m.media-amazon.com/images/I/51vB8v+zX9L._AC_SX679_.jpg",
        "price": 38.90,
        "originalPrice": 42.90
      },
      {
        "name": "Azul",
        "image": "https://m.media-amazon.com/images/I/51wX8v+zX9L._AC_SX679_.jpg",
        "price": 42.90,
        "originalPrice": null
      },
      {
        "name": "Rosa",
        "image": "https://m.media-amazon.com/images/I/51Z-L7L8pL._AC_SX679_.jpg",
        "price": 39.90,
        "originalPrice": 42.90
      },
      {
        "name": "Bege",
        "image": "https://m.media-amazon.com/images/I/51Y-L7L8pL._AC_SX679_.jpg",
        "price": 42.90,
        "originalPrice": null
      }
    ],
    "specifications": {
      "Marca": "Genérico Professional",
      "Capacidade": "800 Mililitros",
      "Material": "Aço Inoxidável 304",
      "Tempo de Conservação": "24h Gelado / 8h Quente",
      "Características especiais": "Isolamento a vácuo, Parede dupla",
      "Adequação": "Academia, Treinos, Viagens"
    },
    "featured": true,
    "createdAt": "2026-02-12T19:05:00.000Z",
    "salesCount": 1500
  },
  {
    "id": "offer-1770921191071-107",
    "name": "Fone de Ouvido Bluetooth 5.3 On-ear. Cancelamento de Ruído e Regulavel para Corridas e Academia, Headphone Sem Fio com Microfone Integrado Confortavel e Dobravel Compativel com Android e IOS.",
    "price": 80.49,
    "costPrice": 57.49,
    "originalPrice": null,
    "description": "➡️ Fones de ouvidos Bluetooth 5.3: Conexão rápida e estável, proporcionando uma experiência auditiva sem interrupções.\n\n➡️ Cancelamento de Ruído: Tecnologia de cancelamento de ruído para uma experiência auditiva imersiva, bloqueando sons indesejados.\n\n➡️ Compatibilidade Universal: Funciona com uma ampla gama de dispositivos, incluindo smartphones, tablets e laptops.\n\n➡️ Design Confortável: O headphone sem fio possui um design ergonômico, perfeito para longas sessões de uso sem desconforto.\n\n➡️ Bateria de Longa Duração: Aproveite horas de reprodução contínua com a bateria de alta capacidade do fones de ouvido bluetooth 5.3",
    "images": [
      "https://m.media-amazon.com/images/I/31byPyMYW5L.jpg",
      "https://m.media-amazon.com/images/I/41ZegpLYkmL.jpg",
      "https://m.media-amazon.com/images/I/41ijA4d6byL.jpg",
      "https://m.media-amazon.com/images/I/51RQWgZS66L.jpg",
      "https://m.media-amazon.com/images/I/413bZywixyL.jpg"
    ],
    "category": "tech",
    "rating": 4.952578275767215,
    "reviews": 480,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61yp3+t01UL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61q8lHkeOTL._SY88.jpg",
      "https://m.media-amazon.com/images/I/619XP8YTaLL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61zcTToNjoL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71IttOjhI9L._SY88.jpg",
      "https://m.media-amazon.com/images/I/71ik5jzCECL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:55:07.261Z",
    "salesCount": 842
  },
  {
    "id": "offer-1770921186745-980",
    "name": "Fone de ouvido sem fio POTIPO M10-TWS Bluetooth 5.1, fone de ouvido intra-auricular à prova d'água IPX7, microfone estéreo com redução de ruído, adequado para esportes, jogos, viagens",
    "price": 32.06,
    "costPrice": 22.9,
    "originalPrice": null,
    "description": "🎧 Emparelhamento em uma etapa e controle de toque: os fones de ouvido sem fio Bluetooth se conectam automaticamente a qualquer dispositivo compatível com Bluetooth, permitindo que você assista a muitos filmes, jogue ou curta música por um longo tempo. Ao tocar no botão do fone de ouvido, você pode alternar facilmente várias funções: controlar mídia e chamadas, reproduzir, pausar, trocar músicas, atender ou rejeitar chamadas.\n\n🎧 Qualidade de som estéreo Hi-Fi: os fones de ouvido bluetooth sem fio POTIPO M10-TWS adotam o chip DSP de unidade de membrana de titânio avançado para fornecer qualidade de som mais delicada e clara, permitindo que você desfrute de cenas HIFI e efeitos de som surround estéreo 9D, trazendo uma experiência auditiva chocante e experiência de uso emocionante.\n\n🎧Longo tempo de reprodução e carregamento rápido: fones de ouvido bluetooth sem fio POTIPO M10-TWS com uma caixa de carregamento com interface Type-C: 4 ~ 5h de tempo de trabalho com uma única carga com um fone de ouvido; 8 ~ 10h com ambos os fones de ouvido; o tempo de espera dos fones de ouvido de até 100 horas; O tempo de carregamento de 1,5 a 2 horas ajuda a carregar os fones de ouvido mais rapidamente.\n\n🎧IPX7 Sports à prova d'água: O fone de ouvido bluetooth sem fio POTIPO M10-TWS adota nano-revestimento, que pode ser muito à prova d'água e dissipar o suor. É uma boa opção para exercícios extenuantes e várias condições climáticas. É adequado para corrida, ioga, esportes, ginástica, ciclismo, etc. (se você precisar usar fones de ouvido durante a natação, envolva os fones de ouvido com protetores de ouvido).\n\n🎧Baixa latência: usando chips profissionais avançados e verdadeira tecnologia Bluetooth 5.1 sem fio, o tempo de atraso de nossos fones de ouvido Bluetooth sem fio no modo de jogo é inferior a 65 ms e a sensação de ausência de atraso fornece uma melhor experiência de jogo, alcançando um som rápido e estável transmissão, trazendo efeitos sonoros puros e sem perdas e a emoção de matar inimigos em segundos.",
    "images": [
      "https://m.media-amazon.com/images/I/31fFhO3i1iL.jpg",
      "https://m.media-amazon.com/images/I/517AhqRR9oL.jpg",
      "https://m.media-amazon.com/images/I/41X1AmaMAAL.jpg",
      "https://m.media-amazon.com/images/I/41egoKTFZ4L.jpg",
      "https://m.media-amazon.com/images/I/31pBYFVBhQL.jpg",
      "https://m.media-amazon.com/images/I/51AWU25NniL.jpg"
    ],
    "category": "tech",
    "rating": 4.598762559329266,
    "reviews": 273,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/51uhsepyBNL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:55:03.259Z",
    "salesCount": 1089
  },
  {
    "id": "offer-1770921179447-21",
    "name": "Fone de Ouvido, Bluetooth 5.4, IPX5 à Prova D'Água, 45h de Bateria, Com Microfone Embutido. Design Esportivo e Ergonômico, Ideal Para Corridas, Atividades Físicas, Videogame, IPhone e Android",
    "price": 111.58,
    "costPrice": 79.7,
    "originalPrice": null,
    "description": "🔋 Som potente por até 15 horas: Bateria de longa duração para seus treinos e dia a dia.\n\n📶 Bluetooth 5.4 sem atrasos: Conexão estável a até 10 metros, com emparelhamento rápido.\n\n💦 Resistente ao suor com IPX5: Perfeito para corridas, academia ou qualquer clima.\n\n📞 Chamadas nítidas onde estiver: Microfone com redução de ruído para conversas claras.\n\n🎧 Ajuste firme e confortável: Ganchos ergonômicos, não cansam.",
    "images": [
      "https://m.media-amazon.com/images/I/418XtZVkDeL.jpg",
      "https://m.media-amazon.com/images/I/41EmUmvtqKL.jpg",
      "https://m.media-amazon.com/images/I/41I2RGch4eL.jpg",
      "https://m.media-amazon.com/images/I/41PKewlOQIL.jpg",
      "https://m.media-amazon.com/images/I/41yBt+3aBEL.jpg",
      "https://m.media-amazon.com/images/I/41y4T9kk2-L.jpg"
    ],
    "category": "tech",
    "rating": 4.648041586296017,
    "reviews": 268,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/a6441766-09c3-41d4-a664-b31cf01c7712",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61ggFKEcitL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71LWo1OGuVL._SY88.jpg",
      "https://m.media-amazon.com/images/I/81ihWEu7PBL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71TsD1DwAjL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:56.755Z",
    "salesCount": 423
  },
  {
    "id": "offer-1770921174536-403",
    "name": "PHILIPS, Fone de Ouvido Sem Fio TWS, TAT1109BK/00, Bluetooth, Com Microfone, Até 24 horas de bateria, Preto",
    "price": 199.26,
    "costPrice": 142.33,
    "originalPrice": null,
    "description": "CONEXÃO BLUETOOTH ESTÁVEL. Tecnologia avançada que garante transmissão contínua sem interrupções. Perfeita para músicas e podcasts com qualidade de áudio superior.\n\nDURAÇÃO DE ATÉ 24 HORAS. Aproveite até 6h de reprodução nos fones e 18h extras no estojo power bank. Carregamento rápido USB-C: 15 minutos para 1 hora extra de uso, mantendo suas músicas sempre com você.\n\nRESISTÊNCIA IPX4 E DESIGN COMPACTO. Resistente a suor, respingos e chuva. Estojo compacto para carregamento e proteção. Ideal para treinos e atividades ao ar livre.\n\nCHAMADAS MAIS NÍTIDAS. Microfone dedicado com tecnologia de redução de ruído elimina interferências, garantindo comunicações claras em qualquer tipo de ambiente.\n\nSOM DE ALTA QUALIDADE COM GRAVES PROFUNDOS. Drivers de 10mm com graves potentes e som equilibrado, garantindo a assinatura sonora Philips em todos os seus conteúdos.",
    "images": [
      "https://m.media-amazon.com/images/I/31eeSqQHCvL.jpg",
      "https://m.media-amazon.com/images/I/41WB0WrMFJL.jpg",
      "https://m.media-amazon.com/images/I/41l25oCi81L.jpg",
      "https://m.media-amazon.com/images/I/31J9OLUjZuL.jpg",
      "https://m.media-amazon.com/images/I/31DlpNNnqRL.jpg",
      "https://m.media-amazon.com/images/I/411DxxAk8JL.jpg"
    ],
    "category": "tech",
    "rating": 4.8061822616881456,
    "reviews": 306,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/2df68240-0709-4c5c-a349-aab6017fa63c",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61mLCwvF4jL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61nAAbJmYYL._SY88.jpg",
      "https://m.media-amazon.com/images/I/6134x-BvJxL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71Z+Et6S4eL._SY88.jpg",
      "https://m.media-amazon.com/images/I/612uoJp7HbL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61eUzpnWzZL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:52.086Z",
    "salesCount": 573
  },
  {
    "id": "offer-1770921170158-487",
    "name": "Fone de Ouvido Bluetooth Sem Fio 5.0 TWS Wireless Compatível com IOS Iphone e Android Redução de Ruído Toque Inteligente Resistente ao Suor Para Trabalho Academia Musculação Treino e Lazer Premium",
    "price": 37.66,
    "costPrice": 26.9,
    "originalPrice": 43.04,
    "description": "Redução de Ruído: Bloqueia Ruído Externos e Melhora a Clareza Sonora em Chamadas e Músicas, proporcionando uma experiência mais imersiva. Experiência sonora superior a fones 3x mais caros.\n\nDesign Ergonômico: Não escorrega durante exercícios, tem certificação IPX5 contra suor e respingos d'água. Ideal para ouvir música ou realizar ligações enquanto faz exercícios. Encaixe perfeito que garante o uso prolongado sem desconforto.\n\nConexão Bluetooth: Pareamento automático e conexão estável até 10 metros. Compatível com IOS, Android e diferentes dispositivos via Bluetooth. Ideal para reuniões virtuais e calls profissionais. Tecnologia True Wireless.\n\nControle através de Toque: Ativa funções com apenas um toque - Play/Pausa, Atende Chamadas, Troca de música.\n\nBaterias de Lítio Recarregáveis : Oferece uma longa duração de até 3 horas para reprodução de músicas e chamadas contínuas.",
    "images": [
      "https://m.media-amazon.com/images/I/31seSPYexSL.jpg",
      "https://m.media-amazon.com/images/I/41S9Xby2MkL.jpg",
      "https://m.media-amazon.com/images/I/41v24NgXZaL.jpg",
      "https://m.media-amazon.com/images/I/41shXsbaLEL.jpg",
      "https://m.media-amazon.com/images/I/41cJg1X-2-L.jpg",
      "https://m.media-amazon.com/images/I/31vRmkFA9nL.jpg",
      "https://m.media-amazon.com/images/I/41Eo2c5aKoL.jpg"
    ],
    "category": "tech",
    "rating": 4.513123299991594,
    "reviews": 354,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": "2026-02-13T18:54:47.724Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61bXfIJR6cL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:47.724Z",
    "salesCount": 1701
  },
  {
    "id": "offer-1770921144269-781",
    "name": "Creatina Pura Dark Lab 300g, Monohidratada 100% de Pureza, Sem Glúten, Sem Sabor",
    "price": 55.86,
    "costPrice": 39.9,
    "originalPrice": 63.84,
    "description": "FORÇA MÁXIMA: Creatina monohidratada com 100% de pureza que aumenta força, resistência e explosão muscular para treinos de alta intensidade\n\nPERFORMANCE ELEVADA: Desenvolvida para atletas e praticantes de musculação que buscam ganho de massa magra e melhora na recuperação muscular\n\nMODO DE USO: Dissolva 3g (1 dosador raso) em 150ml de água, consuma 30 minutos antes do treino para energia e disposição máxima\n\nDOMINE O TREINO: Dark Lab desde 2018 desenvolvendo fórmulas exclusivas com matérias-primas rigorosamente selecionadas para máxima qualidade e resultados reais",
    "images": [
      "https://m.media-amazon.com/images/I/41FiQvX5mGL.jpg",
      "https://m.media-amazon.com/images/I/41cTX-E6JnL.jpg",
      "https://m.media-amazon.com/images/I/41Cj6fFNbzL.jpg",
      "https://m.media-amazon.com/images/I/410xDU4jlsL.jpg",
      "https://m.media-amazon.com/images/I/41CJDkTXQ6L.jpg"
    ],
    "category": "supplements",
    "rating": 4.85813758354533,
    "reviews": 526,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/7ca32ead-7295-4492-ac84-4e7006f5e8ae",
    "expiresAt": "2026-02-13T18:54:22.234Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71uOFgIMbjL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:22.234Z",
    "salesCount": 392
  },
  {
    "id": "offer-1770921140379-357",
    "name": "Creatina Pura 500g Monohidratada Micronizada à 180 mícrons. 101% de Pureza em Laudo. Livre de Metais Pesados",
    "price": 118.5,
    "costPrice": 84.64,
    "originalPrice": null,
    "description": "✔️ NÚMERO #1 EM CREATINA: Nosso produto contém apenas pura creatina monohidratada e micronizada, sem glúten e sem outros ingredientes. E possui maior teor de pureza do Brasil certificado em laudo. Nosso teor de pureza: 101% (veja esse resultado nas imagens do anúncio e confira também no vídeo da descrição).\n\n✔️ PADRÃO OURO INTERNACIONAL: Se você buscar na PUBMED, a plataforma da Biblioteca Nacional de Medicina (NLM) dos EUA, verá que a Creatina mais estudada globalmente é a Monohidratada e Micronizada de uma marca alemã. A micronização das partículas nestes estudos é de 180 mícrons. Nesse tamanho, a creatina mostrou melhor absorção. A NatusVita usa tecnologia de ponta para obter esse mesmo nível de micronização.\n\n✔️ LIVRE DE CONTAMINAÇÃO, SEM METAIS PESADOS: A contaminação da creatina pode ocorrer devido a várias razões, incluindo a utilização de matérias-primas já contaminadas, processos de produção inadequados, contaminação cruzada, uso de aditivos ou solventes impuros, dentre outras razões. A creatina da NatusVita é livre de metais pesados, de acordo com laudo da EUROFINS.\n\n✔️ APOIA A MASSA MUSCULAR E FUNÇÃO CEREBRAL: A creatina é um complexo de aminoácidos que promove a massa corporal magra e apoia o aumento da resistência muscular, capacidade muscular e produção de energia. Adicione a Creatina da NatusVita em sua rotina diária para atingir seus objetivos. Embora a creatina seja conhecida pelos seus benefícios de aumento muscular, também foi demonstrado que apoia a função cognitiva.\n\n⭐ QUALIDADE DE FÁBRICA: Esta é a conta Oficial da NatusVita na Amazon. Este produto é produzido em nossa fábrica que segue todas as normas e protocolos da ANVISA/MS o que garante que você obtenha qualidade consistente em cada dose. Além disso, cada um de nossos lotes são testados e produzimos lotes mensais, o que permite uma validade longa para o produto que está adquirindo aqui.",
    "images": [
      "https://m.media-amazon.com/images/I/41k9-i5dMvL.jpg",
      "https://m.media-amazon.com/images/I/51EEQvKjRqL.jpg",
      "https://m.media-amazon.com/images/I/51oHUDFkAnL.jpg",
      "https://m.media-amazon.com/images/I/51XElIGYIFL.jpg",
      "https://m.media-amazon.com/images/I/41YiXv5nMGL.jpg",
      "https://m.media-amazon.com/images/I/41E5vusvtWL.jpg"
    ],
    "category": "supplements",
    "rating": 4.583656140928478,
    "reviews": 168,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/697e6388-1522-4096-997e-1651e1216c67",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61Qo31wy8lL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61W2wDdaKtL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71gf+KMxxxL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:18.327Z",
    "salesCount": 1004
  },
  {
    "id": "offer-1770921135488-796",
    "name": "Soldiers Nutrition Creatina Monohidratada 500g",
    "price": 55.54,
    "costPrice": 39.67,
    "originalPrice": null,
    "description": "【MAIS ENERGIA E MELHOR DESEMPENHO】A Creatina Monohidratada Soldiers Nutrition é ideal para aumentar a força e o desempenho nos treinos. Com maior capacidade de energia intramuscular, você pode realizar treinos mais intensos sem sobrecarregar o seu corpo.\n\n【POTENCIALIZE O GANHO MUSCULAR】A creatina aumenta o armazenamento de fosfocreatina nos músculos, otimizando a produção de energia durante o treino. Fundamental para quem busca hipertrofia, ela contribui diretamente para o aumento da força, do volume muscular e melhora da resistência.\n\n【RECUPERAÇÃO MAIS RÁPIDA】Além de melhorar o desempenho físico, a Creatina Monohidratada Soldiers Nutrition ajuda na recuperação muscular, reduzindo a fadiga e acelerando o processo de recuperação após exercícios.\n\n【FACILIDADE DE CONSUMO】 A Creatina Monohidratada Soldiers Nutrition é 100% pura e se dissolve e mistura facilmente com qualquer bebida, garantindo uma ingestão prática. Sua fórmula de alta qualidade proporciona absorção rápida e eficaz, otimizando seus treinos, capacidade cognitiva ou saúde do dia a dia.\n\n【ENERGIA A QUALQUER MOMENTO】A creatina pode ser consumida em qualquer horário do dia: após o treino, entre as refeições e até mesmo nos dias de descanso. É recomendado combinar a creatina com carboidratos de alto índice glicêmico para maximizar a absorção.",
    "images": [
      "https://m.media-amazon.com/images/I/41N9+yBWAvL.jpg",
      "https://m.media-amazon.com/images/I/51cl-O7NsFL.jpg",
      "https://m.media-amazon.com/images/I/51+v63nd8ZL.jpg",
      "https://m.media-amazon.com/images/I/51udFe2O9hL.jpg",
      "https://m.media-amazon.com/images/I/51guoOsl09L.jpg",
      "https://m.media-amazon.com/images/I/51+7XeyWcYL.jpg"
    ],
    "category": "supplements",
    "rating": 4.649665832678083,
    "reviews": 393,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/fb6760e7-37d9-4477-bc88-7da95b875056",
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:54:13.365Z",
    "salesCount": 1184
  },
  {
    "id": "offer-1770921130931-521",
    "name": "Integralmedica - Creatina em Pó Hardcore 100% Pura e Monohidratada - 300g",
    "price": 63.62,
    "costPrice": 45.44,
    "originalPrice": null,
    "description": "【MAIS ENERGIA, MELHOR DESEMPENHO】A Creatina Hardcore é ideal para quem deseja potencializar a força e o desempenho nos treinos. Com maior capacidade de energia intramuscular, você pode realizar treinos mais intensos sem sobrecarregar o seu corpo.\n\n【MAXIMIZE O GANHO MUSCULAR】A creatina aumenta o armazenamento de fosfocreatina nos músculos, otimizando a produção de energia durante os exercícios. Essencial para quem busca hipertrofia, ela contribui diretamente para o aumento da força e melhora da resistência, além do próprio volume muscular.\n\n【ACELERE SUA RECUPERAÇÃO】Além de melhorar o desempenho durante o treino, a Creatina Hardcore também ajuda na recuperação muscular, reduzindo a fadiga e acelerando o processo de recuperação após exercícios pesados. Ideal para quem quer sempre estar no seu melhor.\n\n【FACILIDADE DE CONSUMO E ALTA SOLUBILIDADE】 A Creatina Hardcore se dissolve facilmente com o que você decidir misturar, garantindo uma ingestão prática, mais gostosa e sem bolinhas. Sua fórmula de alta qualidade proporciona absorção rápida e eficaz, otimizando seus treinos ao longo do dia a dia.\n\n【SE FORTALEÇA EM QUALQUER HORÁRIO】Pode ser consumida em qualquer momento do dia: após o treino, entre as refeições ou até mesmo nos dias de descanso. Recomenda-se combinar com carboidratos de alto índice glicêmico para maximizar a absorção.",
    "images": [
      "https://m.media-amazon.com/images/I/51gFs8B1uPL.jpg",
      "https://m.media-amazon.com/images/I/51R-gCyb5BL.jpg",
      "https://m.media-amazon.com/images/I/518IAzxXWiL.jpg",
      "https://m.media-amazon.com/images/I/51Fm1FfON4L.jpg",
      "https://m.media-amazon.com/images/I/514A7tgbtRL.jpg",
      "https://m.media-amazon.com/images/I/51lqWgiFh9L.jpg"
    ],
    "category": "supplements",
    "rating": 4.774923762987969,
    "reviews": 333,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/a4641af9-ba8c-41b5-b28f-2e09852d4ee7",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71KvzMOhtNL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71lNCxFRKSL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61MokULOQLL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71-h01OQE9L._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:08.926Z",
    "salesCount": 456
  },
  {
    "id": "offer-1770921126444-884",
    "name": "Creatina Pura Dark Lab 500g, Monohidratada 100% de Pureza, Sem Sabor",
    "price": 69.86,
    "costPrice": 49.9,
    "originalPrice": 79.84,
    "description": "FORÇA MÁXIMA: Creatina monohidratada com 100% de pureza que aumenta força, resistência e explosão muscular para treinos de alta intensidade\n\nQUALIDADE SUPERIOR: Matéria-prima de qualidade com variação mínima, garantindo máxima pureza e absorção rápida\n\nEVOLUÇÃO CONTÍNUA: Desenvolvida para atletas e praticantes de musculação que buscam massa magra e recuperação acelerada\n\nMODO DE USO: Dissolva 3g (1 dosador raso) em 150ml de água, consuma 30 minutos antes do treino para energia e disposição máxima\n\nDOMINE O TREINO: Dark Lab desde 2018 desenvolvendo fórmulas exclusivas com matérias-primas rigorosamente selecionadas para máxima qualidade e resultados reais",
    "images": [
      "https://m.media-amazon.com/images/I/412U1oNTJ0L.jpg",
      "https://m.media-amazon.com/images/I/41X2kYh6HcL.jpg",
      "https://m.media-amazon.com/images/I/41SndfAXrdL.jpg",
      "https://m.media-amazon.com/images/I/41n1Pci6F1L.jpg"
    ],
    "category": "supplements",
    "rating": 4.668653216746453,
    "reviews": 184,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/bc24d636-dc6f-4fa7-8c33-c355da879fb5",
    "expiresAt": "2026-02-13T18:54:04.511Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71VsHTBPRHL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71uo1OgLOQL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61K40xwt3OL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71pW-tx9cnL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:54:04.511Z",
    "salesCount": 831
  },
  {
    "id": "offer-1770921101361-627",
    "name": "Top Nadador Fitness Feminino Academia",
    "price": 25.06,
    "costPrice": 17.9,
    "originalPrice": null,
    "description": "Indicado para exercícios e atividades aeróbicas e uso casual. > Extremamente confortável, flexível e se ajusta no corpo. > Não é necessário passar e não cria bolinhas.",
    "images": [
      "https://m.media-amazon.com/images/I/31AJMJQxooL.jpg"
    ],
    "category": "apparel",
    "rating": 4.687788894693751,
    "reviews": 451,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:53:39.593Z",
    "salesCount": 1022
  },
  {
    "id": "offer-1770921097413-945",
    "name": "Top Fitness Nadador Sem Bojo | Top Alça Fina Nadador Feminino Suplex Liso Academia Ginástica | Moda Fitness | Dyeu Modas",
    "price": 23.66,
    "costPrice": 16.9,
    "originalPrice": null,
    "description": "- QUEM SOMOS: A DYEU MODAS é mais que uma marca, somos um estilo pro dia a dia e sempre compromissados com inovação e progresso. Informados e com visão de futuro, visamos proporcionar o melhor produto, qualidade e um atendimento diferenciado! - OBJETIVO & VISÃO: Temos como objetivo oferecer aos nossos clientes peças que representam a moda, sem abrir mão da qualidade, requinte e conforto. Acreditamos que não existe peça de roupa capaz de mudar o mundo; quem muda o mundo é VOCÊ! Procuramos sempre proporcionar uma experiência segura e satisfatória de compra e também criar uma relação de amizade a longo prazo.",
    "images": [
      "https://m.media-amazon.com/images/I/41Fsy61Dg4L.jpg",
      "https://m.media-amazon.com/images/I/410CGrOeEGL.jpg",
      "https://m.media-amazon.com/images/I/41yOKofP+oL.jpg",
      "https://m.media-amazon.com/images/I/41+Euikb+6L.jpg",
      "https://m.media-amazon.com/images/I/51URQQVQlwL.jpg"
    ],
    "category": "apparel",
    "rating": 4.75190964822829,
    "reviews": 339,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61U0dtoqRPL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:53:35.827Z",
    "salesCount": 227
  },
  {
    "id": "offer-1770921093576-394",
    "name": "Top Academia Puma Alta Sustentação Sem Bojo Sem Costura Treino Fitness Esportivo Feminino Original.",
    "price": 80,
    "costPrice": 57.14,
    "originalPrice": null,
    "description": "Produto de Qualidade",
    "images": [
      "https://m.media-amazon.com/images/I/417L78bQowL.jpg",
      "https://m.media-amazon.com/images/I/41jyOuxHi4L.jpg",
      "https://m.media-amazon.com/images/I/41dDkXHprPL.jpg",
      "https://m.media-amazon.com/images/I/41AuYhWe0rL.jpg",
      "https://m.media-amazon.com/images/I/51cDZhTF9vL.jpg",
      "https://m.media-amazon.com/images/I/41dOujDu3KL.jpg",
      "https://m.media-amazon.com/images/I/51ZHejwBttL.jpg"
    ],
    "category": "apparel",
    "rating": 4.895403382673792,
    "reviews": 276,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:53:31.963Z",
    "salesCount": 2097
  },
  {
    "id": "offer-1770921089487-215",
    "name": "Top Academia Sport Alta Sustentação Sem Bojo Sem Costura Poliamida Elastano Feminino Fitness Selene",
    "price": 69.99,
    "costPrice": 49.99,
    "originalPrice": null,
    "description": "O Top Sport Sem Costura da Selene vem para fazer parte do seu treino, com uma combinação perfeita de estilo esportivo e alto desempenho para seus exercícios!\n\nOs tecidos de alta performance usados em sua confecção garantem maciez e toque suave em contato com a pele. Confeccionado com tecnologia Sem Costuras, evita desconfortos e não marca o busto por não possuir sobras de costuras que poderiam causar incômodos e irritações na pele.\n\nO tecido também auxilia na respirabilidade e na transpiração do suor, mantendo o corpo fresco e livre e eliminando odores indesejados. Devido a isso, a lavagem e secagem são rápidas e fáceis, não perdendo a tonalidade nem a forma, sendo perfeito para ter vários no armário.\n\nSeu modelo nadador é sem bojo e possui detalhe “Sport” nas costas, agregando muito mais estilo em seus exercícios. Versátil, é ideal para a prática de atividades físicas como academia, pilates, caminhada, yoga, beach tennis, tudo aliado ao bem-estar e conforto, podendo ser usado tanto sozinho quanto por baixo de uma blusa.\n\nCom o Top Sport Sem Costura da Selene, você estará muito mais estilosa e pronta para o treino!\n\nComposição: 61% Poliamida, 10% Elastano e 1% Polipropileno.",
    "images": [
      "https://m.media-amazon.com/images/I/41UrViEbXcL.jpg",
      "https://m.media-amazon.com/images/I/51utqcveTiL.jpg",
      "https://m.media-amazon.com/images/I/41JKOakelXL.jpg",
      "https://m.media-amazon.com/images/I/41cQqmmobvL.jpg",
      "https://m.media-amazon.com/images/I/41TLW5Tw2VL.jpg",
      "https://m.media-amazon.com/images/I/51O78W-l7QL.jpg",
      "https://m.media-amazon.com/images/I/517jfBqrXCL.jpg"
    ],
    "category": "apparel",
    "rating": 4.9955998731780396,
    "reviews": 362,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71N58RU3FEL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71c0DdYuVmL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71HHYF2hQTL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:53:27.715Z",
    "salesCount": 1719
  },
  {
    "id": "offer-1770921085621-510",
    "name": "Top Fitness com bojo Corrida Treino Academia Yoga Suplex ALÇA MÉDIA 314",
    "price": 40.18,
    "costPrice": 28.7,
    "originalPrice": 45.92,
    "description": "Produzido com materiais de alta qualidade, garantindo resistência ao uso contínuo. Acabamento impecável que proporciona um toque suave à pele. Não desbota, mantendo as cores vivas por muito mais tempo. Design Moderno e Funcional Top com bojo, proporcionando suporte e ajuste perfeito. Disponível em várias opções de cores, para que você escolha a que melhor combina com seu estilo.",
    "images": [
      "https://m.media-amazon.com/images/I/319tJV7lpGL.jpg",
      "https://m.media-amazon.com/images/I/31FWxKpuOCL.jpg",
      "https://m.media-amazon.com/images/I/31Q5rTimd0L.jpg",
      "https://m.media-amazon.com/images/I/31gMM2GkC8L.jpg",
      "https://m.media-amazon.com/images/I/41Zbk48hOoL.jpg",
      "https://m.media-amazon.com/images/I/41wckJtBu3L.jpg",
      "https://m.media-amazon.com/images/I/31w1f0N7MjL.jpg"
    ],
    "category": "apparel",
    "rating": 4.752921147950389,
    "reviews": 472,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": "2026-02-13T18:53:23.626Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/51uEbFuX-FL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:53:23.626Z",
    "salesCount": 972
  },
  {
    "id": "offer-1770921057226-858",
    "name": "Legging 4 Estações Suplex Básica Fitness Academia",
    "price": 54.46,
    "costPrice": 38.9,
    "originalPrice": null,
    "description": "A 4 Estações, está trazendo para você uma Legging Suplex com aquele conforto e aquela qualidade que todos sabemos que faz a diferença na hora de malhar . Composição: » 90% Poliéster e 10% Elastano. Especificações: » Extremamente confortável, com toque macio e caimento perfeito no corpo. » Costuras duplas para melhor qualidade e reforço do produto. » Não é necessário passar e não cria bolinhas. » Não desbota e não desfia. » Melhor qualidade de tecido para o seu conforto. » Durável.",
    "images": [
      "https://m.media-amazon.com/images/I/31r8yBYuBGL.jpg",
      "https://m.media-amazon.com/images/I/31GB2xuZ3pL.jpg"
    ],
    "category": "apparel",
    "rating": 4.7650228381703945,
    "reviews": 175,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:52:59.649Z",
    "salesCount": 1636
  },
  {
    "id": "offer-1770921053419-149",
    "name": "Calças Legging LupoFeminino",
    "price": 200.06,
    "costPrice": 142.9,
    "originalPrice": null,
    "description": "Antimicrobial: Fio desenvolvido com ação antiviral e antibacteriano. Cós Anatômico: Cós que acompanha a curvatura da cintura para mais segurança e conforto nas suas atividades. As tramas dos produtos em Seamless Dry fazem com que a parte de trás seja mais elevada que a frontal, em uma modelagem regular, a peça ainda conta com a aplicação de silicone que garante aderência e o ajuste perfeito no corpo. Já com a tecnologia sem costura,o cós faz parteda estrutura da peça Fio Texturizado a Ar: A resistência da poliamida com o toquedo algodão.",
    "images": [
      "https://m.media-amazon.com/images/I/31DDa9Hzv6L.jpg",
      "https://m.media-amazon.com/images/I/31qx4fufKlL.jpg",
      "https://m.media-amazon.com/images/I/315Tt9Pr23L.jpg",
      "https://m.media-amazon.com/images/I/41cSsJ4lyhL.jpg",
      "https://m.media-amazon.com/images/I/31CJiLzMDeL.jpg",
      "https://m.media-amazon.com/images/I/41JvnM1lQlL.jpg",
      "https://m.media-amazon.com/images/I/41VS9fxCB5L.jpg"
    ],
    "category": "apparel",
    "rating": 4.850019256705392,
    "reviews": 375,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:52:51.632Z",
    "salesCount": 122
  },
  {
    "id": "offer-1770921049354-802",
    "name": "Calça Legging Fitness Feminino Academia Suplex Donna Martins",
    "price": 69.86,
    "costPrice": 49.9,
    "originalPrice": null,
    "description": "As calças Leggings da Donna Martins, tem um caimento perfeito, se ajustam ao corpo, são confortáveis, especialmente desenvolvidas para mulheres modernas com gostos exigentes.\n\n- Leggings Superconfortáveis\n\n- Tecido Premium: Suplex de Alta Qualidade (Não fica transparente)\n\n- Entrega rápida e segura\n\n- Modelo Fotográfica Real: As Calças são idênticas a foto.\n\n- Marca: Donna Martins\n\n- Modelo: Calças Leggings\n\nMEDIDAS:\n\nP (Tam. 34 – 36)\n\nM (Tam. 38 )\n\nG (Tam. 40– 42)\n\nGG (Tam. 44)\n\nNós da loja Donna Martins. Trazemos o que há de mais atual e moderno no mundo da moda, priorizando sempre a qualidade e o conforto. Procuramos não apenas atender às suas expectativas, mas superá-las.\n\nFabricadas com Tecido Premium, Suplex de alta qualidade. O Suplex é um tecido bastante flexível, resistente e macio. Sua construção acontece de forma semelhante ao tricô, por isso fica mais elástica e retorna a forma original, mesmo após ser esticada.\n\nENVIAMOS PARA TODO BRASIL – FOTOS REAIS – TECIDO, MODELAGEM E ACABAMENTOS PREMIUM.\n\nDÚVIDAS FREQUENTES:\n\n1 – As Calças Leggings vão me servir?\n\nVerifique a tabela de medidas disponível nesse anúncio para te auxiliar na escolha do tamanho correto.\n\n2 – As Leggings são idênticas as fotos?\n\nResposta: Sim, são fiéis as fotos.\n\n3 – Enquanto tempo será enviado meu produto?\n\nResposta: Envio imediato.\n\n4 – O tecido é resistente?\n\nResposta: Sim, nossas peças são fabricadas com tecidos premium, resistentes que possuem lycra/elastano na composição para dar elasticidade e deixar a peça com excelente caimento e mega confortável.\n\n5 – Caso não tenha a cor que escolhi, você envia outro no lugar?",
    "images": [
      "https://m.media-amazon.com/images/I/315bxqzihfL.jpg",
      "https://m.media-amazon.com/images/I/31ggme6TDIL.jpg",
      "https://m.media-amazon.com/images/I/31v5ZD2qLLL.jpg",
      "https://m.media-amazon.com/images/I/31pDQPxTYwL.jpg"
    ],
    "category": "apparel",
    "rating": 4.944114848597746,
    "reviews": 127,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:52:47.577Z",
    "salesCount": 1768
  },
  {
    "id": "offer-1770921045434-692",
    "name": "Calça Legging Lupo 71053-001 Sem Costura",
    "price": 194.46,
    "costPrice": 138.9,
    "originalPrice": null,
    "description": "Faça seus treinos e corra de maneira leve e relaxada com a calça legging Lupo Sport Max Core. Feita de tecido sem costura, tem um ajuste suave que melhora a silhueta feminina.",
    "images": [
      "https://m.media-amazon.com/images/I/31MNoCR0CgL.jpg",
      "https://m.media-amazon.com/images/I/51urSt0BVXL.jpg",
      "https://m.media-amazon.com/images/I/41OAY20O9ML.jpg",
      "https://m.media-amazon.com/images/I/51MFLIeG4fL.jpg",
      "https://m.media-amazon.com/images/I/51B0xsVBOtL.jpg",
      "https://m.media-amazon.com/images/I/41JSDneXDUL.jpg",
      "https://m.media-amazon.com/images/I/61accSVE7DS.jpg"
    ],
    "category": "apparel",
    "rating": 4.731425846132444,
    "reviews": 405,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T18:52:43.735Z",
    "salesCount": 1309
  },
  {
    "id": "offer-1770921003591-383",
    "name": "Garrafa Térmica 1000ML - Duplamente Isolada a Vácuo, Aço Inox 304,Capa Protetora da Base de Silicone, Mantém Bebidas Gelada 24 horas e Quente 12 horas",
    "price": 97.86,
    "costPrice": 69.9,
    "originalPrice": 111.84,
    "description": "Contém: Uma Garrafa 1000ml, Base Emborrachada anti derrapante\n\nConserva Bebidas Frias por 24 Horas e Quentes por até 12 Horas\n\nIdeal para Uso em Atividades ao Ar Livre, Academia, Trabalho, Viagens, Negócios e Turismo\n\nFabricado pela Termal Flask\n\nFeito em Aço Inoxidável 304 – Medidas: Altura 30 cm, Largura 9 cm",
    "images": [
      "https://m.media-amazon.com/images/I/31femD2BZoL.jpg",
      "https://m.media-amazon.com/images/I/31b0uCPv8rL.jpg",
      "https://m.media-amazon.com/images/I/41NCmPwTK0L.jpg",
      "https://m.media-amazon.com/images/I/41KkeSpykgL.jpg",
      "https://m.media-amazon.com/images/I/41WyHNSa4XL.jpg",
      "https://m.media-amazon.com/images/I/41BMOunVzCL.jpg",
      "https://m.media-amazon.com/images/I/614EyhbiTXL.SS125_PKplay-button-mb-image-grid-small_.jpg"
    ],
    "category": "equipment",
    "rating": 4.891731980448575,
    "reviews": 124,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/8a8c576a-f82b-45a5-9774-ff9a284a7eb2",
    "expiresAt": "2026-02-13T18:52:02.236Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61cetbKYuLL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:52:02.236Z",
    "salesCount": 809
  },
  {
    "id": "offer-1770920977973-389",
    "name": "Relógio Digital Feminino Masculino Smartwatch Inteligente Bluetooth, Full Touch a Prova d 'água IP68 com 120+ Modos de Exercício e Esporte, Cinza",
    "price": 188.99,
    "costPrice": 134.99,
    "originalPrice": 215.98,
    "description": "Atenda chamadas: Com o Watch FB025, é possível atender ou rejeitar chamadas diretamente do seu pulso, desde que haja conexão via Bluetooth com o seu celular\n\nBateria de Longa Duração: O smartwatch esportivo acompanha um cabo USB de carregamento rápido, bateria de 280 mAh, suporta de 7 dias de uso e mais de 15 dias em modo de espera após 2 horas de carga da bateria. Leve-o com você para viajar, caminhar, nadar e trabalhar, nunca se preocupe com a bateria acabando\n\nIP68 à prova d'água e ampla compatibilidade: Um smartwatch à prova d'água projetado com tecnologia avançada IP68 que permite que você lave as mãos, tome banho e esportes aquáticos. Baixe e instale o aplicativo gratuito \" Da Fit\", ele sincronizará com seu telefone instantaneamente\n\nFuncionalidades de Mensagens e Redes Sociais: O relógio possibilita a leitura de mensagens de plataformas como WhatsApp, Facebook, Twitter, entre outras. No entanto, não oferece a capacidade de responder a essas mensagens. Além disso, ele exibe notificações de redes sociais diretamente na tela do dispositivo\n\nContém: caixa de presente、carregador magnético、manual do usuário, garantia de dois meses",
    "images": [
      "https://m.media-amazon.com/images/I/41NTpbrHTsL.jpg",
      "https://m.media-amazon.com/images/I/51kAjx92paL.jpg",
      "https://m.media-amazon.com/images/I/51jpgD4DpkL.jpg",
      "https://m.media-amazon.com/images/I/51+MGLSeumL.jpg",
      "https://m.media-amazon.com/images/I/51EkXWOB8CL.jpg",
      "https://m.media-amazon.com/images/I/41wlcpQEogL.jpg"
    ],
    "category": "tech",
    "rating": 4.736159780058933,
    "reviews": 171,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/0e60342c-ac0d-4600-8431-ba1255e68c95",
    "expiresAt": "2026-02-13T18:51:37.541Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/6124l8goY+L._SY88.jpg",
      "https://m.media-amazon.com/images/I/71RNrujEDQL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:51:37.541Z",
    "salesCount": 1954
  },
  {
    "id": "offer-1770920973824-308",
    "name": "Bettdow SmartWatch, Relogio Smartwatch Feminino, 1.27\" Ecrã tátil, à prova d'água IP68, 100+ Modos Esportivos, chamada Bluetooth, Compatível com Android iOS, voz por IA",
    "price": 397.67,
    "costPrice": 284.05,
    "originalPrice": null,
    "description": "Mais de 100 Modos Esportivos e Multifuncionais: Incluindo corrida, ciclismo, basquete, ioga e natação, este smartwatch oferece suporte aos seus objetivos de condicionamento físico. Recursos adicionais incluem alertas de chamadas, atualizações meteorológicas, pedômetro, reprodução de música e calculadora. Seja para exercícios ou para a conveniência diária, este smartwatch aprimora seu estilo de vida.\n\nResistência à água IP68 e longa duração da bateria: A classificação IP68 à prova d'água protege o relógio contra suor, chuva e lavagem das mãos. Com um design de baixo consumo de energia, desfrute de 5 a 7 dias de uso com uma única carga, além de mais de 20 dias em modo de espera, minimizando a necessidade de recargas frequentes.\n\nChamadas Bluetooth 5.3 e Notificações Inteligentes: O microfone integrado e o alto-falante de alto desempenho garantem uma qualidade de áudio nítida. Mantenha-se conectado com a capacidade de fazer e receber chamadas, mesmo enquanto estiver dirigindo ou cozinhando. Receba notificações em tempo real de mensagens SMS, Facebook, WhatsApp, Instagram, TikTok, Twitter e muito mais, para nunca perder atualizações importantes.\n\nAssistente de Voz com IA : Bettdow smartwatch Defina alarmes e temporizadores, verifique o clima, obtenha traduções, controle seus dispositivos de casa inteligente, crie listas de compras e muito mais com o Assistente de Voz com IA.\n\nTela HD de 1,27 polegadas e mostradores de relógio personalizáveis: Desfrute de uma tela HD full-touch de 1,27 polegadas que oferece uma exibição nítida e clara e interação suave por toque para um uso sem esforço. Personalize seu relógio com mais de 100 mostradores de relógio integrados ou carregue suas próprias fotos para criar um design exclusivo. Combine o mostrador do seu relógio com seu estilo, humor ou ocasião com opções de personalização.",
    "images": [
      "https://m.media-amazon.com/images/I/41rmy611AhL.jpg",
      "https://m.media-amazon.com/images/I/51a7MOKScUL.jpg",
      "https://m.media-amazon.com/images/I/41ocxf6leqL.jpg",
      "https://m.media-amazon.com/images/I/41sHt1Fx5OL.jpg",
      "https://m.media-amazon.com/images/I/41owmmQd2ML.jpg",
      "https://m.media-amazon.com/images/I/41RoHBkDC1L.jpg"
    ],
    "category": "tech",
    "rating": 4.785430280700713,
    "reviews": 282,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/ae184795-f831-4e3a-b4f0-c66e4b65cca1",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61NOmnqKNZL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61u8IIMArwL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61ynyP66YcL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61BNTM9ldRL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61lE2PjmNIL._SY88.jpg",
      "https://m.media-amazon.com/images/I/51MayInKD1L._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:51:33.443Z",
    "salesCount": 871
  },
  {
    "id": "offer-1770920969292-503",
    "name": "RELÓGIO REDMI WATCH 5 ACTIVE",
    "price": 333.06,
    "costPrice": 237.9,
    "originalPrice": null,
    "description": "Bateria de Longa Duração: Fique conectado por até 14 dias com uma única carga, garantindo desempenho constante sem preocupações.\n\nSincronização Inteligente: Receba notificações de chamadas, mensagens e redes sociais diretamente no seu pulso, com conectividade Bluetooth 5.0 para maior rapidez e eficiência.\n\nTela de Alta Resolução: Experimente imagens mais vivas e nítidas com uma tela colorida de 1,75\", ideal para visualizar notificações, monitorar atividades físicas e personalizar seu estilo.\n\nModos de Treino e Exercícios: Explore diferentes atividades com modos de treino personalizados para acompanhar seu desempenho físico e superar seus objetivos.\n\nDesign Elegante e Funcional: Desenvolvido para conforto e estilo, com pulseira de silicone leve e resistente à água (5ATM), perfeito para o uso diário.",
    "images": [
      "https://m.media-amazon.com/images/I/31ii-PcEDjL.jpg",
      "https://m.media-amazon.com/images/I/41UZOH8X3EL.jpg",
      "https://m.media-amazon.com/images/I/411qvfXcMVL.jpg",
      "https://m.media-amazon.com/images/I/41DUKKsOboL.jpg"
    ],
    "category": "tech",
    "rating": 4.625870866084842,
    "reviews": 98,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/61IVOTperxL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61ENOQGFCtL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61pSg6+wFCL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61+eMU-vxqL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71VWF7NZkQL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61vpwPSZC5L._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:51:28.934Z",
    "salesCount": 1656
  },
  {
    "id": "offer-1770920964635-640",
    "name": "Bettdow SmartWatch, relogio smartwatch com Ecrã tátil e Alexa, à prova d'água IP68, relogio feminino e masculino, com 100+ modo esportivo e recebimento de notificações",
    "price": 177.39,
    "costPrice": 126.71,
    "originalPrice": null,
    "description": "Relógio esportivo：Relógio esportivo, 100 modos de exercício regulares, suporte para de corrida, Yoga, pular corda, Futebol, natação e outros vários modos de exercício\n\nAMAZON ALEXA : Bettdow smartwatch Defina alarmes e temporizadores, verifique o clima, obtenha traduções, controle seus dispositivos de casa inteligente, crie listas de compras e muito mais com o assistente de voz Amazon Alexa.\n\nChamada de voz Bluetooth: O relógio smartwatch adulto unissex não apenas exibe a hora, mas também pode fazer e receber chamadas e receber notificações de mensagens via Bluetooth.\n\nIP68 à prova d'água: você pode usar o smartwatch masculino à prova d'água IP68 para lavar as mãos e tomar banho sem se preocupar com danos causados ​​pela água, atendendo melhor às suas necessidades diárias.\n\nBateria de longa duração: Relogio smartwatch aproveite o uso ininterrupto com até 48 horas de uso contínuo e até 7 dias de uso regular. No modo standby, a bateria dura até 30 dias.Além disso, o relógio é amplamente compatível com Android e iOS.",
    "images": [
      "https://m.media-amazon.com/images/I/31JRkZkyNBL.jpg",
      "https://m.media-amazon.com/images/I/41bVKECWTVL.jpg",
      "https://m.media-amazon.com/images/I/41OQpRfiJJL.jpg",
      "https://m.media-amazon.com/images/I/51oct0PjQXL.jpg",
      "https://m.media-amazon.com/images/I/51Su8KWhJVL.jpg",
      "https://m.media-amazon.com/images/I/41RCNAkWLUL.jpg"
    ],
    "category": "tech",
    "rating": 4.872352599388637,
    "reviews": 489,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/b1e6282f-c669-46df-81e6-7547efe7fffa",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71LD-EPwONL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61FMUyiQdyL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71uwUDXOqaL._SY88.jpg",
      "https://m.media-amazon.com/images/I/713KK4MUb3L._SY88.jpg",
      "https://m.media-amazon.com/images/I/71fgNrPJrgL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61ZWuMV-78L._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:51:24.455Z",
    "salesCount": 1252
  },
  {
    "id": "offer-1770920960481-580",
    "name": "Smartwatch Samsung Galaxy Fit3 Display 1.6\" Grafite",
    "price": 376.74,
    "costPrice": 269.1,
    "originalPrice": null,
    "description": "Para começar a usar o Galaxy Fit3, uma conta Samsung deve estar cadastrada em seu celular. Seus dados de saúde no seu Galaxy Fit3 serão transferidos com segurança e armazenados na Samsung Cloud conectada à sua conta, para que você possa acessar e gerenciar totalmente seus dados.\n\nQuando a bateria estiver completamente descarregada, o Fit não ligará. Carregue totalmente o bateria antes de ligar o Fit.\n\nA tela sensível ao toque pode funcionar mal em condições úmidas ou quando exposta à água.",
    "images": [
      "https://m.media-amazon.com/images/I/31MIW2XKLrL.jpg",
      "https://m.media-amazon.com/images/I/41T+oXRbjdL.jpg",
      "https://m.media-amazon.com/images/I/41YuKRh4jOL.jpg",
      "https://m.media-amazon.com/images/I/51lDn0KEhKL.jpg",
      "https://m.media-amazon.com/images/I/51eABcFkCXL.jpg",
      "https://m.media-amazon.com/images/I/41aiA72M+vL.jpg",
      "https://m.media-amazon.com/images/I/41WOnZuDmqL.jpg"
    ],
    "category": "tech",
    "rating": 4.632919371117351,
    "reviews": 410,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/51UOrzyKW8L._SY88.jpg",
      "https://m.media-amazon.com/images/I/61T7zidOJsL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61NKVfjqQgL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61UBfNIgLhL._SY88.jpg",
      "https://m.media-amazon.com/images/I/611cQqwBpEL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T18:51:20.276Z",
    "salesCount": 604
  },
  {
    "id": "offer-1770920935228-731",
    "name": "Kit 2 Camisetas Masculina Dry Fit Anti-Odor Academia Treino Fitness M ao G1",
    "price": 85.39,
    "costPrice": 60.99,
    "originalPrice": null,
    "description": "Descubra o conforto e a performance com o nosso Kit 3 Camisetas Masculina Dry Fit, ideal para quem busca qualidade e estilo durante os treinos na academia ou ao ar livre. Nossa marca VB ONLINE é sinônimo de inovação e compromisso com a sustentabilidade, oferecendo peças que não só vestem, mas também inspiram e empoderam. Com um design pensado para atletas e entusiastas do fitness, cada camiseta é uma aliada para seus exercícios, promovendo uma experiência de uso superior. ESPECIFICAÇÕES TÉCNICAS: - Idade: Adultos - Marca: VB ONLINE - Composição: 100% poliéster - Desenho do tecido: Liso - Tipo de tecido: Dry Fit - Gênero filtrável: Masculino - Tipo de roupa: Camiseta - Modelo: Dry Fit - Usos recomendados: Atletismo, Basquete, Caminhada, Ciclismo, Corrida, Crossfit, Futebol, Musculação - Tipo de manga: Curta - Tipo de gola: Redonda - Com materiais reciclados: Sim - 150 Gramas - Tamanhos Disponíveis : P/M/G/GG/G1 A tecnologia Dry Fit do tecido proporciona uma rápida absorção e evaporação do suor, mantendo você seco e confortável durante toda a atividade física. As zonas de ventilação estratégicas aumentam a respirabilidade, enquanto a composição 100% poliéster garante leveza e durabilidade. Além disso, o material é resistente a desbotamento e de fácil manutenção, secando rapidamente após a lavagem. Para manter a qualidade do seu kit, recomendamos evitar o uso de amaciantes e não lavar em temperaturas elevadas. Siga as instruções de cuidado para preservar as propriedades do tecido. ORIGEM DO PRODUTO: - Fabricado no Brasil ITENS INCLUSOS: - 2 Camisetas Dry Fit Masculina GARANTIA: - 7 dias de garantia de acordo com a lei do consumidor. Nossa visão é ser uma marca líder que cria um impacto positivo na indústria da moda. Ao escolher o Kit 3 Camisetas Masculina Dry Fit da VB ONLINE, você está optando por um produto que alia performance, estilo e responsabilidade ambiental. Não perca a oportunidade de elevar seu treino a um novo patamar. Adquira já o seu kit e sinta a diferença em cada movimento!",
    "images": [
      "https://m.media-amazon.com/images/I/51XI9nLR8eL.jpg",
      "https://m.media-amazon.com/images/I/31usGOvdVaL.jpg",
      "https://m.media-amazon.com/images/I/31xM4JxWbdL.jpg",
      "https://m.media-amazon.com/images/I/31WhhUcEDeL.jpg",
      "https://m.media-amazon.com/images/I/31v5cuS-mIL.jpg",
      "https://m.media-amazon.com/images/I/31K2NBXLeqL.jpg",
      "https://m.media-amazon.com/images/I/61O78zL-WfL.SX38_SY50_CR,0,0,38,50_PKmb-play-button-overlay-thumb_.jpg"
    ],
    "category": "apparel",
    "rating": 4.626646379861154,
    "reviews": 312,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/2789ff95-ee75-4b1f-9c94-a01eb89cddc9",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/81XSl3H9EQL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:03:54.064Z",
    "salesCount": 1739
  },
  {
    "id": "offer-1770920931240-788",
    "name": "Camiseta Dry Fit Academia Masculina Esportiva Selene",
    "price": 83.99,
    "costPrice": 59.99,
    "originalPrice": null,
    "description": "Versátil, confortável e com um toque moderno, a Camiseta Masculina Dry Fit da Selene é ideal para treinos, caminhadas, atividades ao ar livre ou até para compor looks casuais com praticidade e estilo. Com modelagem pensada para o corpo masculino, ela oferece liberdade total de movimento para quem tem uma rotina ativa e dinâmica.\nConfeccionada em malha esportiva com tecnologia Dry Fit, essa camiseta acelera a evaporação do suor e melhora a circulação de ar, mantendo a pele seca e fresca durante toda a atividade. A composição em malha esportiva proporciona leveza e toque macio, além de favorecer a secagem rápida, perfeita para quem não quer perder tempo no dia a dia.\nO caimento é suave e anatômico, adaptando-se ao corpo sem apertar ou limitar os movimentos. A malha é resistente e mantém sua estrutura mesmo após lavagens frequentes, sem desbotar, encolher ou deformar, ideal para quem busca durabilidade sem abrir mão do conforto.\nCombinando respirabilidade, resistência e praticidade, a Camiseta Dry Fit da Selene é aquela peça coringa que te acompanha em todos os momentos: no treino, no lazer e até nas tarefas cotidianas, sempre com estilo e funcionalidade.\nComposição: 100% Poliéster",
    "images": [
      "https://m.media-amazon.com/images/I/41QNMrhm3WL.jpg",
      "https://m.media-amazon.com/images/I/510DFuwrV+L.jpg",
      "https://m.media-amazon.com/images/I/51l62W1A5gL.jpg",
      "https://m.media-amazon.com/images/I/51e5GT2Yf+L.jpg",
      "https://m.media-amazon.com/images/I/51VvCpqz8CL.jpg",
      "https://m.media-amazon.com/images/I/51IyXobYcHL.jpg"
    ],
    "category": "apparel",
    "rating": 4.626535571867436,
    "reviews": 525,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:03:50.246Z",
    "salesCount": 1683
  },
  {
    "id": "offer-1770920927440-902",
    "name": "Camiseta UV Protection Masculina UV50+ Tecido Ice Dry Fit Secagem Rápida",
    "price": 83.86,
    "costPrice": 59.9,
    "originalPrice": 95.84,
    "description": "Camiseta Slim Fitness Uv Protection - Proteção Solar Uv50 + Bactericida\n\nCamisa Térmica Segunda Pele UV PROTECTION Slim Fitness, criada para proteger a pele da ação nociva dos raios UV-A e UV-B, com o fator de proteção solar FPS 50+ presente em seu DNA. Bloqueia de 99% dos raios UV-A e UV-B, além de um fator de proteção 50 (FPU 50+) que não sai após as lavagens.\n\nA alta tecnologia do tecido foi desenvolvida para permitir mais liberdade de movimentos, proporcionando melhor desempenho, sustentação e suporte em longo prazo, sempre com o máximo de conforto.\n\nComposição: 90% Poliamida 10% Elastano\n\nProteção UV: Adequada para exposição ao Sol, o efeito de proteção UV é permanente.\n\nUso: Piscina; Praia; Trilha; Pescaria; Caminhada; Corrida; Atividades ao Ar Livre; Voo a Vela; Veleiro\n\nTipo: Manga longa\n\nGola: Redonda\n\nOrigem: Nacional - Slim Fitness Fashion\n\nGarantia: Contra defeitos de fabricação.\n\nCuidados: Dispensa o uso de amaciante, Dispensa o uso de ferro de passar\n\nMEDIDAS APROXIMADAS:\n\"P\" = 61cm x 50cm x 46cm (comprimento x largura x manga)\n\"M\" = 63cm x 52cm x 48cm (comprimento x largura x manga)\n\"G\" = 65cm x 54cm x 50cm (comprimento x largura x manga)\n\"GG\" = 67cm x 56cm x 52cm (comprimento x largura x manga)\nEGG= 69cm x 58cm x 54cm (comprimento x largura x manga)\n\nMODELAGEM NORMAL, TAMANHO ADULTO PADRÃO",
    "images": [
      "https://m.media-amazon.com/images/I/31lPs-hIELL.jpg",
      "https://m.media-amazon.com/images/I/31l1ZQeTXZL.jpg",
      "https://m.media-amazon.com/images/I/51MTvJEoWpL.jpg",
      "https://m.media-amazon.com/images/I/31jPqlnZlBL.jpg",
      "https://m.media-amazon.com/images/I/41PCg4IBYVL.jpg",
      "https://m.media-amazon.com/images/I/41a0bVrijfL.jpg",
      "https://m.media-amazon.com/images/I/71x0zvgxj4L.SX38_SY50_CR,0,0,38,50_PKmb-play-button-overlay-thumb_.jpg"
    ],
    "category": "apparel",
    "rating": 4.744475220176167,
    "reviews": 520,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/1c7f9fe5-1d63-47af-91ff-7e5937aa650e",
    "expiresAt": "2026-02-13T19:03:46.399Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71K6KonCHiL._SY88.jpg",
      "https://m.media-amazon.com/images/I/81oopZeRRyL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:03:46.399Z",
    "salesCount": 899
  },
  {
    "id": "offer-1770920923404-564",
    "name": "Kit 3 Camisetas Masculina Dry Fit Esportivo Anti-Odor Treino academia fitness do M ao G1",
    "price": 125.99,
    "costPrice": 89.99,
    "originalPrice": null,
    "description": "Descubra o conforto e a performance com o nosso Kit 3 Camisetas Masculina Dry Fit, ideal para quem busca qualidade e estilo durante os treinos na academia ou ao ar livre. Nossa marca VB ONLINE é sinônimo de inovação e compromisso com a sustentabilidade, oferecendo peças que não só vestem, mas também inspiram e empoderam. Com um design pensado para atletas e entusiastas do fitness, cada camiseta é uma aliada para seus exercícios, promovendo uma experiência de uso superior. ESPECIFICAÇÕES TÉCNICAS: - Idade: Adultos - Marca: VB ONLINE - Composição: 100% poliéster - Desenho do tecido: Liso - Tipo de tecido: Dry Fit - Gênero filtrável: Masculino - Tipo de roupa: Camiseta - Modelo: Dry Fit - Usos recomendados: Atletismo, Basquete, Caminhada, Ciclismo, Corrida, Crossfit, Futebol, Musculação - Tipo de manga: Curta - Tipo de gola: Redonda - Com materiais reciclados: Sim - 150 Gramas - Tamanhos Disponíveis : P/M/G/GG/G1 A tecnologia Dry Fit do tecido proporciona uma rápida absorção e evaporação do suor, mantendo você seco e confortável durante toda a atividade física. As zonas de ventilação estratégicas aumentam a respirabilidade, enquanto a composição 100% poliéster garante leveza e durabilidade. Além disso, o material é resistente a desbotamento e de fácil manutenção, secando rapidamente após a lavagem. Para manter a qualidade do seu kit, recomendamos evitar o uso de amaciantes e não lavar em temperaturas elevadas. Siga as instruções de cuidado para preservar as propriedades do tecido. ORIGEM DO PRODUTO: - Fabricado no Brasil ITENS INCLUSOS: - 3 Camisetas Dry Fit Masculina GARANTIA: - 7 dias de garantia de acordo com a lei do consumidor. Nossa visão é ser uma marca líder que cria um impacto positivo na indústria da moda. Ao escolher o Kit 3 Camisetas Masculina Dry Fit da VB ONLINE, você está optando por um produto que alia performance, estilo e responsabilidade ambiental. Não perca a oportunidade de elevar seu treino a um novo patamar. Adquira já o seu kit e sinta a diferença em cada movimento!",
    "images": [
      "https://m.media-amazon.com/images/I/41uVzOQ9tnL.jpg",
      "https://m.media-amazon.com/images/I/31HYv9rFM-L.jpg",
      "https://m.media-amazon.com/images/I/31-zpd3ApaL.jpg",
      "https://m.media-amazon.com/images/I/31xM4JxWbdL.jpg",
      "https://m.media-amazon.com/images/I/31WhhUcEDeL.jpg",
      "https://m.media-amazon.com/images/I/319S2NpuoiL.jpg",
      "https://m.media-amazon.com/images/I/61O78zL-WfL.SX38_SY50_CR,0,0,38,50_PKmb-play-button-overlay-thumb_.jpg"
    ],
    "category": "apparel",
    "rating": 4.9429030010829145,
    "reviews": 398,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/b342563c-81e6-468c-bda8-f2d167e5d478",
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:03:42.251Z",
    "salesCount": 593
  },
  {
    "id": "offer-1770920919211-479",
    "name": "Kit 2 Camisetas Dry Fit Academia Esportiva Masculina Speedo",
    "price": 97.99,
    "costPrice": 69.99,
    "originalPrice": null,
    "description": "O Kit com 2 Camisetas Dry Fit da Speedo foi desenvolvido para quem vive o esporte com intensidade e valoriza conforto, leveza e praticidade no dia a dia. Seja para treinos na academia, corridas ao ar livre ou até para compor looks casuais de forma moderna e funcional, essas camisetas se adaptam facilmente a qualquer rotina ativa.\nA malha Dry Fit garante rápida evaporação do suor, mantendo a pele seca e fresca mesmo nos treinos mais intensos ou nos dias de calor. Já a liberdade de movimento proporcionada pelo tecido permite que cada movimento seja natural, sem incômodos ou limitações. O caimento leve abraça o corpo de forma confortável, evitando qualquer tipo de abafamento e deixando a experiência mais agradável durante todo o uso.\nCom composição resistente, essas camisetas mantêm sua forma e cor mesmo após lavagens frequentes, reforçando sua praticidade para rotinas esportivas exigentes. Essa resistência das fibras garante mais vida útil às peças, tornando-as uma opção confiável para diferentes modalidades. Além disso, o kit com 2 camisetas oferece economia e versatilidade, permitindo alternância entre treinos ou composições do dia a dia.\nE, para completar, a qualidade Speedo entrega confiança e desempenho em cada detalhe. Modernas, funcionais e preparadas para acompanhar sua evolução, essas camisetas são o complemento perfeito para quem busca conforto, tecnologia e alta performance em qualquer momento da rotina esportiva.\n\nComposição: 100% Poliéster.",
    "images": [
      "https://m.media-amazon.com/images/I/31OjPUAW9lL.jpg",
      "https://m.media-amazon.com/images/I/511LbIn4qzL.jpg",
      "https://m.media-amazon.com/images/I/51soeUCMdJL.jpg",
      "https://m.media-amazon.com/images/I/51HKa-zFaGL.jpg",
      "https://m.media-amazon.com/images/I/41K-e+iwT9L.jpg",
      "https://m.media-amazon.com/images/I/51zdk6NwOvL.jpg"
    ],
    "category": "apparel",
    "rating": 4.957727224647801,
    "reviews": 215,
    "sizes": [
      "P",
      "M",
      "G",
      "GG"
    ],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:03:38.084Z",
    "salesCount": 1912
  },
  {
    "id": "offer-1770920894590-100",
    "name": "Whey Protein Concentrado Cookies Pote 900g – Contribui para o Ganho Muscular Hipertrofia – Dux Human Health",
    "price": 248.92,
    "costPrice": 177.8,
    "originalPrice": 284.48,
    "description": "Favorece o ganho de massa muscular\n\nProteínas de alto valor biológico\n\nAporte de aminoácidos\n\nFeito com materiais de qualidade",
    "images": [
      "https://m.media-amazon.com/images/I/418WZjNlJEL.jpg",
      "https://m.media-amazon.com/images/I/41zbGgbYn0L.jpg"
    ],
    "category": "supplements",
    "rating": 4.788575533802255,
    "reviews": 475,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/c156a45e-c78e-4adf-b197-548eb9675282",
    "expiresAt": "2026-02-13T19:03:12.906Z",
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:03:12.906Z",
    "salesCount": 1956
  },
  {
    "id": "offer-1770920889690-592",
    "name": "Max Titanium Whey Pro Pote 1kg - Sabor Chocolate",
    "price": 110.59,
    "costPrice": 78.99,
    "originalPrice": null,
    "description": "15g de Proteína por doses\n\nMelhor sabor do mercado\n\nFonte de aminoácidos essenciais\n\nAs proteínas auxiliam na formação dos músculos e ossos",
    "images": [
      "https://m.media-amazon.com/images/I/41LCmOkzUbL.jpg",
      "https://m.media-amazon.com/images/I/413PCf3TKoL.jpg",
      "https://m.media-amazon.com/images/I/31T09Brr4TL.jpg",
      "https://m.media-amazon.com/images/I/51R6qLVUXBL.jpg",
      "https://m.media-amazon.com/images/I/51bEF56X11L.jpg",
      "https://m.media-amazon.com/images/I/51uBiujYRGL.jpg"
    ],
    "category": "supplements",
    "rating": 4.911648678914899,
    "reviews": 247,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/5a728ce8-d47e-443f-ad3c-8ed094c50908",
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71jnRJsQWOL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:03:08.236Z",
    "salesCount": 431
  },
  {
    "id": "offer-1770920885508-228",
    "name": "Integralmedica - Hipercalórico - Nutri Whey Protein Baunilha - Pouch 900g - Fonte de Proteínas e Carboidratos - Suplemento Alimentar, Ganho Muscular e Recuperação Pós-Treino - Super Mass Gainer",
    "price": 78.4,
    "costPrice": 56,
    "originalPrice": 89.6,
    "description": "Os hipercalóricos de modo geral, são suplementos à base de carboidratos e proteínas que tem como função principal o aumento de peso corporal e ganho de massa magra.\n\nCom uma fórmula de fácil solubilidade e delicioso sabor, NUTRI WHEY PROTEIN POUCH é um hipercalórico diferenciado, pois além da oferta energética vinda dos carboidratos que é a principal função do produto, NUTRI WHEY contém 30 g das melhores proteínas que estão relacionadas a recuperação e ganho de massa muscular, essas proteínas contribuem com o aporte de aminoácidos essenciais que são compostos que participam da síntese proteica e promovem a melhor recuperação principalmente no período pós treino.",
    "images": [
      "https://m.media-amazon.com/images/I/51dhS4l3QdL.jpg",
      "https://m.media-amazon.com/images/I/41Yt0aA2dUL.jpg",
      "https://m.media-amazon.com/images/I/51mD8IlQ0TL.jpg",
      "https://m.media-amazon.com/images/I/51g36jqgpwL.jpg",
      "https://m.media-amazon.com/images/I/518lo4pDfzL.jpg",
      "https://m.media-amazon.com/images/I/41b--tmz5mL.jpg"
    ],
    "category": "supplements",
    "rating": 4.760880653410405,
    "reviews": 304,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": "2026-02-13T19:03:03.827Z",
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71uxu3mQPqL._SY88.jpg",
      "https://m.media-amazon.com/images/I/31llRYbq-FL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61+SMUqKwiL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:03:03.827Z",
    "salesCount": 812
  },
  {
    "id": "offer-1770920880740-415",
    "name": "Whey Protein Concentrado Baunilha Pote 900g – Contribui para o Ganho Muscular Hipertrofia – Dux Human Health",
    "price": 236.74,
    "costPrice": 169.1,
    "originalPrice": null,
    "description": "【PROTEÍNA CONCENTRADA 100% PURA】Descubra o Whey Protein Concentrado da DUX Human Health, uma proteína pura extraída diretamente do soro do leite, ideal para a manutenção da massa muscular.\n\n【VERSÁTIL PARA TOMAR A QUALQUER MOMENTO】Com a pureza do soro do leite, pode ser consumido a qualquer hora do dia, seja no café da manhã, antes ou depois dos treinos. Misture com água, leite ou adicione em suas receitas favoritas.\n\n【20g DE PROTEÍNA POR PORÇÃO】Cada porção oferece 20g de proteína pura e de fácil absorção, garantindo suporte ideal para o crescimento e recuperação muscular, com foco em desempenho físico e saúde geral.\n\n【RICO EM AMINOÁCIDOS ESSENCIAIS】Com um perfil completo de aminoácidos, incluindo 2,2g de leucina, 3,5g de glutamina e 4,6g de BCAAs, o Whey Protein Concentrado acelera a recuperação muscular e promove a construção de massa magra de forma eficaz.\n\n【ALTA QUALIDADE E ABSORÇÃO】Feito com ingredientes de alta qualidade, o Whey Protein Concentrado da DUX Human Health é uma fonte prática e eficaz de proteína, essencial para quem busca melhorar a performance física, sem aditivos artificiais.",
    "images": [
      "https://m.media-amazon.com/images/I/41Uj8oqHSCL.jpg",
      "https://m.media-amazon.com/images/I/41t6ggyD2yL.jpg",
      "https://m.media-amazon.com/images/I/51coEHJJN5L.jpg",
      "https://m.media-amazon.com/images/I/51v8nvZ885L.jpg"
    ],
    "category": "supplements",
    "rating": 4.875357521840522,
    "reviews": 153,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "video": "blob:https://www.amazon.com.br/bc739ce7-13d1-4d58-9020-41d1d62dd0f8",
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:02:59.199Z",
    "salesCount": 108
  },
  {
    "id": "offer-1770920875877-575",
    "name": "Whey 100% Hd - 900G Refil Baunilha, Black Skull",
    "price": 125.86,
    "costPrice": 89.9,
    "originalPrice": 143.84,
    "description": "Misture 3 colheres de sopa (aprox. 30g) de Whey 100% HD em 150 ml de água, ou de acordo com a consistência desejada, e consuma uma vez ao dia ou de acordo com a orientação de um profissional especiali\n\n21 gramas de proteína por dose; - BCAA; - Fácil preparo; - Fácil digestão; - Fonte proteica; - Melhor absorção; - Recuperação muscular pós-treino\n\nProteína concentrada do soro do leite, proteína isolada do soro de leite, proteína hidrolisada do soro do leite, l-leucina, l-isoleucina, l-valina, aromatizante, espessante goma xantana, corante verme",
    "images": [
      "https://m.media-amazon.com/images/I/41+acqeCbIL.jpg",
      "https://m.media-amazon.com/images/I/41WoUjox1RL.jpg",
      "https://m.media-amazon.com/images/I/51g8Nuk3pxL.jpg",
      "https://m.media-amazon.com/images/I/510ARpOxZ9L.jpg"
    ],
    "category": "supplements",
    "rating": 4.512662060929329,
    "reviews": 225,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": "2026-02-13T19:02:54.176Z",
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:02:54.176Z",
    "salesCount": 491
  },
  {
    "id": "offer-1770920850095-872",
    "name": "Kit de halteres 20Kg com suporte Kettlebell - Equipamento de musculação 6 em 1",
    "price": 560,
    "costPrice": 400,
    "originalPrice": null,
    "description": "Novo modelo de halteres, mais reforçado e com acabamento mais polido\n\nFácil para montar e desmontar, combinando os halteres com a barra você obtêm uma gama maior de execícios\n\nFeito de plástico industrial, produto resistente e duradouro, além de não arranhar o seu piso\n\nAs anilhas possuem marcação da numeração referente ao seu respectivo peso\n\nAs anilhas são feitas de plástico industrial, preenchidas com cimento, já estão cheias é só usar",
    "images": [
      "https://m.media-amazon.com/images/I/41CEp3rv29L.jpg",
      "https://m.media-amazon.com/images/I/41QuQfJH7TL.jpg",
      "https://m.media-amazon.com/images/I/51RNFfXfeGL.jpg",
      "https://m.media-amazon.com/images/I/315qkeLm73L.jpg",
      "https://m.media-amazon.com/images/I/41zNklmvowL.jpg",
      "https://m.media-amazon.com/images/I/41F3eOgG-TL.jpg",
      "https://m.media-amazon.com/images/I/31wvGylgjcL.jpg"
    ],
    "category": "equipment",
    "rating": 4.759973137439568,
    "reviews": 117,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71xuljOlSrL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:02:28.291Z",
    "salesCount": 1597
  },
  {
    "id": "offer-1770920845963-616",
    "name": "Halteres Barra Anilha Regulável Kit 6 em 1 Academia Anilhas Halter 20kg Dumbell Kettlebell",
    "price": 587.86,
    "costPrice": 419.9,
    "originalPrice": null,
    "description": "Kit 20 kg versátil e compacto: transforme qualquer canto em academia e guarde fácil 6 em 1: use como barra, halteres e kettlebell (base + puxadores) Carga ajustável com progressão: anilhas de 1,25kg, 1,5 kg e 2 kg para evoluir com segurança Pegada firme: barras em ferro tubular emborrachado para mais aderência e controle Menos ruído e piso protegido: anilhas com revestimento em PE, ideais para casa/apto Conteúdo: 1 barra extensora, 2 barras rosqueáveis + 4 roscas, base + 2 puxadores Anilhas: 4x1,25 kg + 4x1,5 kg + 4x2 kg; materiais pó de ferro + cimento com revestimento em PE Cor: preto com verde; montagem rápida e praticidade no dia a dia",
    "images": [
      "https://m.media-amazon.com/images/I/41v1F7GeyRL.jpg",
      "https://m.media-amazon.com/images/I/51Huub1L8QL.jpg",
      "https://m.media-amazon.com/images/I/51QgHKpP0ZL.jpg",
      "https://m.media-amazon.com/images/I/51Z7GctV9sL.jpg",
      "https://m.media-amazon.com/images/I/51hFzHQZJhL.jpg",
      "https://m.media-amazon.com/images/I/51b2rnHJ+1L.jpg",
      "https://m.media-amazon.com/images/I/51z543rhVRL.jpg"
    ],
    "category": "equipment",
    "rating": 4.945681187416104,
    "reviews": 431,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [],
    "createdAt": "2026-02-12T19:02:24.304Z",
    "salesCount": 257
  },
  {
    "id": "offer-1770920842101-925",
    "name": "Kit Halteres de Anilhas e Barras Fitness 30kg",
    "price": 532,
    "costPrice": 380,
    "originalPrice": null,
    "description": "Novo modelo de halteres, mais reforçado e com acabamento mais polido e agora com 30KG!\n\nFácil para montar e desmontar, combinando os halteres com a barra você obtêm uma gama maior de execícios\n\nFeito de plástico industrial, produto resistente e duradouro, além de não arranhar o seu piso\n\nAs anilhas possuem marcação da numeração referente ao seu respectivo peso\n\nAs anilhas são feitas de plástico industrial, preenchidas com cimento, já estão cheias é só usar",
    "images": [
      "https://m.media-amazon.com/images/I/41+uSvLFk6L.jpg",
      "https://m.media-amazon.com/images/I/41DE1w9arwL.jpg",
      "https://m.media-amazon.com/images/I/410MHBDKNqL.jpg",
      "https://m.media-amazon.com/images/I/41jgAfMHiQL.jpg",
      "https://m.media-amazon.com/images/I/41-ioRQiIJL.jpg",
      "https://m.media-amazon.com/images/I/31BMNGKksxL.jpg",
      "https://m.media-amazon.com/images/I/41qvvSPL4hL.jpg"
    ],
    "category": "equipment",
    "rating": 4.56521589759384,
    "reviews": 337,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71U1zIrj7JL._SY88.jpg",
      "https://m.media-amazon.com/images/I/71zjsCioeKL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:02:20.673Z",
    "salesCount": 459
  },
  {
    "id": "offer-1770920838088-485",
    "name": "Kit de Halteres com Suporte – 3 Pesos, Cores Roxo e Vermelho Ideal para Exercícios em Casa",
    "price": 300.86,
    "costPrice": 214.9,
    "originalPrice": null,
    "description": "CONJUNTO COMPLETO: Kit de halteres com 3 pares de pesos diferentes e suporte organizador prático para armazenamento eficiente\n\nDESIGN ERGONÔMICO: Halteres hexagonais antiderrapantes que não rolam, proporcionando maior segurança durante os exercícios\n\nVERSATILIDADE: Ideal para diversos exercícios de força, resistência e tonificação muscular, perfeito para treinos em casa\n\nSUPORTE ORGANIZADOR: Base resistente com encaixes específicos para cada halter, mantendo seu espaço de treino organizado\n\nDURABILIDADE: Construção robusta em material resistente, com revestimento emborrachado para maior conforto durante o uso",
    "images": [
      "https://m.media-amazon.com/images/I/41O-fRFivkL.jpg",
      "https://m.media-amazon.com/images/I/51sT9+HQkrL.jpg",
      "https://m.media-amazon.com/images/I/319UuNVbcKL.jpg",
      "https://m.media-amazon.com/images/I/41YJnRsRzNL.jpg",
      "https://m.media-amazon.com/images/I/41kC+9Vx4uL.jpg"
    ],
    "category": "equipment",
    "rating": 4.514771603361784,
    "reviews": 392,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71CXmJAIu-L._SY88.jpg",
      "https://m.media-amazon.com/images/I/61D3gKfeTSL._SY88.jpg",
      "https://m.media-amazon.com/images/I/61-jS8J1GEL._SY88.jpg",
      "https://m.media-amazon.com/images/I/810lzSrj-xL._SY88.jpg",
      "https://m.media-amazon.com/images/I/711jpVL1s4L._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:02:16.879Z",
    "salesCount": 755
  },
  {
    "id": "offer-1770920833767-457",
    "name": "Kit Halteres Ajustáveis 6 em 1 com Barra Central 30kg – Para Treino em Casa ou Academia – Anilhas Revestidas, Peso Modular e Pegada Antiderrapante",
    "price": 558.6,
    "costPrice": 399,
    "originalPrice": null,
    "description": "Kit 6 em 1 com halteres ajustáveis e barra central para montagem de barra reta\n\nPegada ergonômica com revestimento antiderrapante em vinil\n\nA forma redonda dos halteres garante que eles permaneçam estáveis no chão, evitando acidentes e facilitando o armazenamento\n\nIdeal para treino de braços, peito, costas, ombros e abdômen\n\nEstrutura modular fácil de montar e armazenar",
    "images": [
      "https://m.media-amazon.com/images/I/41HUvwa+m0L.jpg",
      "https://m.media-amazon.com/images/I/31UQjMCAhKL.jpg",
      "https://m.media-amazon.com/images/I/41cKce9x9WL.jpg",
      "https://m.media-amazon.com/images/I/31OWk6xbDrL.jpg",
      "https://m.media-amazon.com/images/I/512DI4uWIBL.jpg",
      "https://m.media-amazon.com/images/I/51RKVifghsL.jpg",
      "https://m.media-amazon.com/images/I/41emm-6e8+L.jpg"
    ],
    "category": "equipment",
    "rating": 4.805327186581901,
    "reviews": 528,
    "sizes": [],
    "colors": [
      "Padrão"
    ],
    "variants": [],
    "featured": true,
    "expiresAt": null,
    "reviewsImages": [
      "https://m.media-amazon.com/images/I/71wMWBoWWGL._SY88.jpg"
    ],
    "createdAt": "2026-02-12T19:02:13.014Z",
    "salesCount": 1124
  }
]